1G_Air_Vehicle_Hotel/End_Session-1G.txt

End Session-Request
******************************************************************** 
<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/">
   <soapenv:Header/>
   <soapenv:Body>
      <ter:EndTerminalSessionReq TargetBranch="TPKIKSBUT" xmlns:ter="http://www.travelport.com/schema/terminal_v33_0" xmlns:com="http://www.travelport.com/schema/common_v33_0">
         <com:BillingPointOfSaleInfo OriginApplication="UAPI"/>
         <com:HostToken Host="1G" Key="1T">7DE47C7C-49E8-4360-5063-5180D91780B3</com:HostToken>
      </ter:EndTerminalSessionReq>
   </soapenv:Body>
</soapenv:Envelope>

End Session-Response
******************************************************************** 
<SOAP:Envelope xmlns:SOAP="http://schemas.xmlsoap.org/soap/envelope/">
   <SOAP:Body>
      <terminal:EndTerminalSessionRsp TransactionId="5A51CE6C0A0D6A921E18D0D77D64242F" ResponseTime="71" xmlns:terminal="http://www.travelport.com/schema/terminal_v33_0">
         <common_v33_0:ResponseMessage Code="601" Type="Info" xmlns:common_v33_0="http://www.travelport.com/schema/common_v33_0">Terminal End Session Successful</common_v33_0:ResponseMessage>
      </terminal:EndTerminalSessionRsp>
   </SOAP:Body>
</SOAP:Envelope>